# CanExecuteEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CanExecuteEventArgs Members
CanExecuteEventArgs Class Methods Properties See Also
---
The CanExecuteEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSelectedCategoryIds | Gets the category ids of selected elements. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ActiveDocument | The active document.  (Inherited from CommandEventArgs.) |
| Cancel | Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it.  (Inherited from RevitEventArgs.) |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitEventArgs.) |
| CanExecute | The value that indicates whether the Command associated with this event can be executed. |
| CommandId | The command id.  (Inherited from CommandEventArgs.) |
| IsChecked | The value that indicates whether the UI associated with the Command associated with this event is in a checked state. |

# See Also
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace